/**
*********************************************************************************************************
*                                  Beijing Iava Internet Software Co.,Ltd
*
*                             (c) Copyright 2008-2100, Iava, Beijing, China
*                                            All Rights Reserved
*
* @file
* @brief           log输出方法.
* @date            2012/2/10 18:12:43
* @author          xujie.
*
* Copyright Statement : This software is protected by Copyright and the information contained
*                       herein is confidential. The software may not be copied and the information
*                       contained herein may not be used or disclosed except with the written
*                       permission of IAVA Inc. (C) 2010 *
*********************************************************************************************************
*/
#ifndef _EMU_SYS_LOG_C
#define _EMU_SYS_LOG_C

/*
*********************************************************************************************************
*                                            INCLUDE FILES
*********************************************************************************************************
*/
#include <stdio.h>
#include <time.h>
#include "emu_sys_log.h"

/*
*********************************************************************************************************
*                                          CONSTANTS & MACROS
*********************************************************************************************************
*/
#if (LOG_OUT_TERMINAL == 1)
#define MAC_IAVA_LOG_PRINT(...) __android_log_print(ANDROID_LOG_DEBUG, "IavaDebug", __VA_ARGS__)
#endif

/*
*********************************************************************************************************
*                                              DATA TYPES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                           GLOBAL VARIABLES
*********************************************************************************************************
*/
#if (LOG_OUT_TERMINAL == 1)
static FILE *emuSysLogFile = NULL;
#endif

/*
*********************************************************************************************************
*                                     EXTERN FUNCTION PROTOTYPES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                     STATIC FUNCTION PROTOTYPES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                     GLOBAL FUNCTION PROTOTYPES
*********************************************************************************************************
*/
#if (LOG_OUT_TERMINAL == 1)
/**
****************************************************************************************
* @brief        开启Log输出文件                                                        *
* @param[in]                                                                           *
* @return                                                                              *
* @author       xujie                                                                  *
***************************************************************************************/
void Iava_SysPrintfOpen(void)
{
	/*----------------------------------------------------------------*/
	/* Local Variables                                                */
	/*----------------------------------------------------------------*/

	/*----------------------------------------------------------------*/
	/* Code Body                                                      */
	/*----------------------------------------------------------------*/
	emuSysLogFile = fopen("/sdcard/iava.log", "wb");
}
/**
****************************************************************************************
* @brief        关闭Log输出文件                                                        *
* @param[in]                                                                           *
* @return                                                                              *
* @author       xujie                                                                  *
***************************************************************************************/
void Iava_SysPrintfClose(void)
{
	/*----------------------------------------------------------------*/
	/* Local Variables                                                */
	/*----------------------------------------------------------------*/

	/*----------------------------------------------------------------*/
	/* Code Body                                                      */
	/*----------------------------------------------------------------*/
	fclose(emuSysLogFile);
	emuSysLogFile = NULL;
}
/**
****************************************************************************************
* @brief        打印到标准输出                                                         *
* @param[in]    format      输出格式                                                   *
* @return       IS32        最终输出长度                                               *
* @author       xujie                                                                  *
***************************************************************************************/
int Iava_SysPrintf(char *format, ...)
{
	/*----------------------------------------------------------------*/
	/* Local Variables                                                */
	/*----------------------------------------------------------------*/
	va_list marker;
	char buffer[1024];
	int len;

	/*----------------------------------------------------------------*/
	/* Code Body                                                      */
	/*----------------------------------------------------------------*/
	va_start(marker, format);
	len = vsnprintf(buffer, 1024, format, marker);
	va_end(marker);

	if(emuSysLogFile)
	{
		fwrite(buffer, 1, len, emuSysLogFile);
		fwrite("\n", 1, strlen("\n"), emuSysLogFile);
	}
	else
	{
		MAC_IAVA_LOG_PRINT("emuSysLogFile Error");
		MAC_IAVA_LOG_PRINT("%s",buffer);
	}
	return len;
}
#endif

/**
****************************************************************************************
* @brief        终端输出内存十六进制数据                                               *
* @param[in]    mem      输出内存首地址                                                *
* @param[in]    len      输出字节数                                                    *
* @return                                                                              *
* @author       xujie                                                                  *
***************************************************************************************/
void Iava_SysLogOutputMem(char *mem, int len)
{
	/*----------------------------------------------------------------*/
	/* Local Variables                                                */
	/*----------------------------------------------------------------*/
	int i;

	/*----------------------------------------------------------------*/
	/* Code Body                                                      */
	/*----------------------------------------------------------------*/
	Iava_SysPrintf("\n 0x%x(%d): ", mem, len);
	for(i = 0; i < len; )
	{
		Iava_SysPrintf("\n: offset=%x: %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x",
		i, *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++) ,*(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++), *(mem ++));
		i += 16;
	}
}

/**
****************************************************************************************
* @brief        获得微妙级时间                                              *
* @return       US                                                                       *
* @author       lfl                                                                  *
***************************************************************************************/
unsigned int Iava_SysGetUS(void)
{
	unsigned int ret = 0;
#if defined (WIN32)
	ret =  GetTickCount();

//	Iava_SysPrintf("current time(US) is 0x%x", ret);

#elif defined (__QNX__)
	clock_t start_time, end_time;//clock_t  定义为_unit32t

	ret = clock(); //  ret = clock() / CLOCKS_PER_SEC * 1000000;
#else
	struct timeval begin;

	gettimeofday(&begin, NULL);

	ret = begin.tv_sec * 1000000 + begin.tv_usec;
#endif
	return ret;
}


void  asm_debug_data0(unsigned int u32_x_data)
{
	Iava_SysPrintf("ASM DEBUG = %x", u32_x_data);
}

void  asm_debug_data1(unsigned int u32_x_data)
{
	Iava_SysPrintf("DEBUG = %x", u32_x_data);
}

void  asm_debug_data2(unsigned int u32_x_data)
{
	Iava_SysPrintf("SP_ADDR = %x", u32_x_data);
}

#endif /* _EMU_SYS_LOG_C */
