/**
*********************************************************************************************************
*                                  Beijing Iava Internet Software Co.,Ltd
*
*                             (c) Copyright 2008-2100, Iava, Beijing, China
*                                            All Rights Reserved
*
* @file
* @brief           log输出方法.
* @date            2012/2/10 18:17:56
* @author          xujie.
*
* Copyright Statement : This software is protected by Copyright and the information contained
*                       herein is confidential. The software may not be copied and the information
*                       contained herein may not be used or disclosed except with the written
*                       permission of IAVA Inc. (C) 2010 *
*********************************************************************************************************
*/
#ifndef _EMU_SYS_LOG_H
#define _EMU_SYS_LOG_H

/*
*********************************************************************************************************
*                                            INCLUDE FILES
*********************************************************************************************************
*/
#if defined (WIN32)
#include <windows.h>


#elif defined (__QNX__)
#include <stdio.h>


#else
//未找到ANDROID平台的宏
#include <android/log.h>
#endif


#define CMU_SPHINX_TEST_PERFORMANCE	0
/*
*********************************************************************************************************
*                                          CONSTANTS & MACROS
*********************************************************************************************************
*/
#define LOG_OUT_TERMINAL	0		// 0:console   1:file

#if defined (WIN32)
//#define Iava_SysPrintf(...)  
#define Iava_SysPrintf(...) printf(__VA_ARGS__)



#elif defined (__QNX__)
//#define Iava_SysPrintf(...)
#define Iava_SysPrintf(...) printf(__VA_ARGS__)



#else
//未找到ANDROID平台的宏
#define Iava_SysPrintf(...) __android_log_print(ANDROID_LOG_DEBUG, "IavaDebug", __VA_ARGS__)

#endif

/*
*********************************************************************************************************
*                                              DATA TYPES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                       GLOBAL VARIABLES EXTERN
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                       GLOBAL FUNCTION EXTERN
*********************************************************************************************************
*/
#if (LOG_OUT_TERMINAL == 1)
/**
****************************************************************************************
* @brief        开启Log输出文件                                                        *
* @param[in]                                                                           *
* @return                                                                              *
* @author       xujie                                                                  *
***************************************************************************************/
extern void Iava_SysPrintfOpen(void);

/**
****************************************************************************************
* @brief        关闭Log输出文件                                                        *
* @param[in]                                                                           *
* @return                                                                              *
* @author       xujie                                                                  *
***************************************************************************************/
extern void Iava_SysPrintfClose(void);

/**
****************************************************************************************
* @brief        打印到标准输出                                                         *
* @param[in]    format      输出格式                                                   *
* @return       IS32        最终输出长度                                               *
* @author       fengtao                                                                *
***************************************************************************************/
extern int Iava_SysPrintf(char *format, ...);
#endif

/**
****************************************************************************************
* @brief        终端输出内存十六进制数据                                               *
* @param[in]    mem      输出内存首地址                                                *
* @param[in]    len      输出字节数                                                    *
* @return                                                                              *
* @author       xujie                                                                  *
***************************************************************************************/
extern void Iava_SysLogOutputMem(char *mem, int len);


/**
****************************************************************************************
* @brief        获得微妙级时间                                              *
* @return       US                                                                       *
* @author       lfl                                                                  *
***************************************************************************************/
extern unsigned int Iava_SysGetUS(void);

/**
****************************************************************************************
* @brief        汇编调试                                              *
* @return       void                                                                       *
* @author       lfl                                                                  *
***************************************************************************************/
extern void  asm_debug_data0(unsigned int u32_x_data);

/**
****************************************************************************************
* @brief        汇编调试                                              *
* @return       void                                                                       *
* @author       lfl                                                                  *
***************************************************************************************/
extern void  asm_debug_data1(unsigned int u32_x_data);

/**
****************************************************************************************
* @brief        汇编调试                                              *
* @return       void                                                                       *
* @author       lfl                                                                  *
***************************************************************************************/
extern void  asm_debug_data2(unsigned int u32_x_data);
#endif /* _EMU_SYS_LOG_H */
